In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

**VISUALIZACION DE LOS DATOS**

A continuación la exploración de los siete archivos CSV que se han utilizado para la creaion de la base de datos final.

**1. Tabla actores**

In [2]:
actor_original= pd.read_csv('data/actor.csv')
actor=actor_original.copy()

In [3]:
actor.shape

(200, 4)

In [4]:
actor.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

In [5]:
actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [6]:
actor['complete_name']= actor.first_name + ' ' + actor.last_name

actor.head() #Se ha añadido una nueva columna complete_name para posteriormente poder añadirla a otra tabla.

   actor_id first_name     last_name          last_update        complete_name
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33     PENELOPE GUINESS
1         2       NICK      WAHLBERG  2006-02-15 04:34:33        NICK WAHLBERG
2         3         ED         CHASE  2006-02-15 04:34:33             ED CHASE
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33  JOHNNY LOLLOBRIGIDA

In [7]:
actor=actor.drop(['last_update'], axis=1) # Se ha eliminado la columna last_update ya que carece de información relevante para el proyecto.

In [8]:
actor.head()

   actor_id first_name     last_name        complete_name
0         1   PENELOPE       GUINESS     PENELOPE GUINESS
1         2       NICK      WAHLBERG        NICK WAHLBERG
2         3         ED         CHASE             ED CHASE
3         4   JENNIFER         DAVIS       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  JOHNNY LOLLOBRIGIDA

**2. Tabla category**

In [9]:
category_original= pd.read_csv('data/category.csv')
category=category_original.copy()

In [10]:
category.shape

(16, 3)

In [11]:
category.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 512.0+ bytes

In [12]:
category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [13]:
category=category.drop(['last_update'], axis=1) #Igualmente se elimina la columna last_update

In [14]:
category.head()

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

**3. Tabla films**

In [15]:
film_original= pd.read_csv('data/film.csv')
film=film_original.copy()

In [16]:
film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [17]:
film=film.drop(['last_update'], axis=1) #eliminamos la columna que no nos interesa.

In [18]:
film=film.drop(['original_language_id'], axis=1) #es una columa de nulos.

In [19]:
film.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   release_year      1000 non-null   int64
 4   language_id       1000 non-null   int64
 5   rental_duration   1000 non-null   int64
 6   rental_rate       1000 non-null   float64
 7   length            1000 non-null   int64
 8   replacement_cost  1000 non-null   float64
 9   rating            1000 non-null   object
 10  special_features  1000 non-null   object
dtypes: float64(2), int64(5), object(4)
memory usage: 86.1+ KB

In [20]:
film.shape

(1000, 11)

In [21]:
film.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes

**4. Tabla inventory**

En la tabla inventory, como no teniamos todas las peliculas de la tabla films, se han añadido todas las que faltaban.

In [22]:
inventory_original= pd.read_csv('data/inventory.csv')
inventory=inventory_original.copy()

In [23]:
inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [24]:
inventory=inventory.drop(['last_update'], axis=1) #eliminamos de nuevo la columna last_update

In [25]:
inventory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
dtypes: int64(3)
memory usage: 23.6 KB

In [26]:
inventory.shape

(1000, 3)

In [27]:
inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

In [28]:
mask = ~film['film_id'].isin(inventory['film_id'])
film_new = film.loc[mask][['film_id']]
inventory2 = pd.concat([inventory, film_new], ignore_index=False)

In [29]:
inventory2.reset_index(drop = True, inplace=True)
inventory2.head(-1)

      inventory_id  film_id  store_id
0              1.0        1       1.0
1              2.0        1       1.0
2              3.0        1       1.0
3              4.0        1       1.0
4              5.0        1       2.0
...            ...      ...       ...
1787           NaN      995       NaN
1788           NaN      996       NaN
1789           NaN      997       NaN
1790           NaN      998       NaN
1791           NaN      999       NaN

[1792 rows x 3 columns]

In [30]:

inventory2["inventory_id"]= None

In [31]:
inventory2["inventory_id"]= [i for i in range(1793)]

In [32]:
inventory2["store_id"] = 1

In [33]:
inventory2.head(-1)

      inventory_id  film_id  store_id
0                0        1         1
1                1        1         1
2                2        1         1
3                3        1         1
4                4        1         1
...            ...      ...       ...
1787          1787      995         1
1788          1788      996         1
1789          1789      997         1
1790          1790      998         1
1791          1791      999         1

[1792 rows x 3 columns]

In [34]:
inventory=inventory2

In [35]:
len(inventory.film_id.unique())

1000

In [36]:
inventory.head()

   inventory_id  film_id  store_id
0             0        1         1
1             1        1         1
2             2        1         1
3             3        1         1
4             4        1         1

**5. Tabla language**

In [37]:
language_original= pd.read_csv('data/language.csv')
language=language_original.copy()

In [38]:
language.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [39]:
language=language.drop(['last_update'], axis=1)

In [40]:
language.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
dtypes: int64(1), object(1)
memory usage: 224.0+ bytes

In [41]:
language.shape

(6, 2)

In [42]:
language.head()

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

**6. Tabla old_HDD**

In [43]:

old_original= pd.read_csv('data/old_HDD.csv')
old=old_original.copy()

In [44]:
old.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [45]:
old['complete_name']= old.first_name + ' ' + old.last_name #se crea una nueva tabla complete_name para unirla luego con actors

In [46]:
old.head()

,first_name,last_name,title,release_year,category_id,complete_name
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPE GUINESS
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,PENELOPE GUINESS
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,PENELOPE GUINESS
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,PENELOPE GUINESS
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,PENELOPE GUINESS

In [47]:
old= old.merge(actor, on= 'complete_name', how='left')

In [48]:
old.head()

,first_name_x,last_name_x,title,release_year,category_id,complete_name,actor_id,first_name_y,last_name_y
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPE GUINESS,1,PENELOPE,GUINESS
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,PENELOPE GUINESS,1,PENELOPE,GUINESS
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,PENELOPE GUINESS,1,PENELOPE,GUINESS
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,PENELOPE GUINESS,1,PENELOPE,GUINESS
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,PENELOPE GUINESS,1,PENELOPE,GUINESS

In [49]:
old.head()

,first_name_x,last_name_x,title,release_year,category_id,complete_name,actor_id,first_name_y,last_name_y
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPE GUINESS,1,PENELOPE,GUINESS
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,PENELOPE GUINESS,1,PENELOPE,GUINESS
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,PENELOPE GUINESS,1,PENELOPE,GUINESS
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,PENELOPE GUINESS,1,PENELOPE,GUINESS
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,PENELOPE GUINESS,1,PENELOPE,GUINESS

In [50]:
old= old.merge(film, on= 'title', how='left')

In [51]:
old.head()

,first_name_x,last_name_x,title,release_year_x,category_id,complete_name,actor_id,first_name_y,last_name_y,film_id,description,release_year_y,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPE GUINESS,1,PENELOPE,GUINESS,1,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,PENELOPE GUINESS,1,PENELOPE,GUINESS,23,A Lacklusture Display of a Dentist And a Denti...,2006,1,3,0.99,92,9.99,R,"Trailers,Deleted Scenes"
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,PENELOPE GUINESS,1,PENELOPE,GUINESS,25,A Thoughtful Display of a Woman And a Astronau...,2006,1,3,2.99,74,15.99,G,Trailers
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,PENELOPE GUINESS,1,PENELOPE,GUINESS,106,A Amazing Display of a Mad Cow And a Pioneer w...,2006,1,4,2.99,61,14.99,G,Trailers
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,PENELOPE GUINESS,1,PENELOPE,GUINESS,140,A Emotional Character Study of a Pioneer And a...,2006,1,6,0.99,87,23.99,G,"Trailers,Commentaries,Behind the Scenes"

In [52]:
old=old[['actor_id', 'film_id']] #Se han unido las tablas films y actor

In [53]:
old.head()

   actor_id  film_id
0         1        1
1         1       23
2         1       25
3         1      106
4         1      140

In [54]:
old2=old_original

In [55]:
old2.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [56]:
old2= old2.merge(film, on= 'title', how='left')

In [57]:
old2.head()

,first_name,last_name,title,release_year_x,category_id,film_id,description,release_year_y,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,1,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,23,A Lacklusture Display of a Dentist And a Denti...,2006,1,3,0.99,92,9.99,R,"Trailers,Deleted Scenes"
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,25,A Thoughtful Display of a Woman And a Astronau...,2006,1,3,2.99,74,15.99,G,Trailers
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,106,A Amazing Display of a Mad Cow And a Pioneer w...,2006,1,4,2.99,61,14.99,G,Trailers
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,140,A Emotional Character Study of a Pioneer And a...,2006,1,6,0.99,87,23.99,G,"Trailers,Commentaries,Behind the Scenes"

In [58]:
old2=old2[['film_id','category_id']] #Se unen las tablas films y category

In [59]:
old2.head()

   film_id  category_id
0        1            6
1       23            2
2       25           13
3      106           10
4      140           14

In [60]:
old2.drop_duplicates(inplace=True)

In [61]:
old2.shape

(614, 2)

**7. Tabla rental**

In [62]:
rental_original= pd.read_csv('data/rental.csv')
rental=rental_original.copy()

In [63]:
rental=rental.drop(['last_update'], axis=1)

In [64]:
rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
dtypes: int64(4), object(2)
memory usage: 47.0+ KB

In [65]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [66]:
actor.head()

   actor_id first_name     last_name        complete_name
0         1   PENELOPE       GUINESS     PENELOPE GUINESS
1         2       NICK      WAHLBERG        NICK WAHLBERG
2         3         ED         CHASE             ED CHASE
3         4   JENNIFER         DAVIS       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  JOHNNY LOLLOBRIGIDA

In [67]:
actor=actor.drop(['complete_name'], axis=1)

A continuación exportamos los datos a SQL.

In [68]:
from sqlalchemy import create_engine

str_conn = 'mysql+pymysql://root:3164@localhost:3306'

cursor = create_engine(str_conn)

cursor.execute('drop database if exists videoclub;')

cursor.execute('create database videoclub;')

In [69]:
str_conn = 'mysql+pymysql://root:3164@localhost:3306/videoclub'

cursor = create_engine(str_conn)

In [70]:
actor.to_sql(name='actors', con=cursor, if_exists='replace', index=False)

200

In [71]:
film.to_sql(name='films', con=cursor, if_exists='replace', index=False)

1000

In [72]:
old.to_sql(name='actorsfilms', con=cursor, if_exists='replace', index=False)

1000

In [73]:
category.to_sql(name='categorys', con=cursor, if_exists='replace', index=False)

16

In [74]:
old2.to_sql(name='categorysfilms', con=cursor, if_exists='replace', index=False)

614

In [75]:
language.to_sql(name='language', con=cursor, if_exists='replace', index=False)

6

In [76]:
inventory.to_sql(name='inventory', con=cursor, if_exists='replace', index=False)

1793